---
kind: other
id: AllMembers.T:Autodesk.Revit.UI.IExternalEventHandler
source: html/d149beed-2b00-6a1e-af70-8ec56d9718b3.htm
---
# IExternalEventHandler Members

This method is called to handle the external event.